import React from "react";

// block
import Slider from "../Slider/Slider";

// style
import "./Conditions.scss";

export default function Conditions() {
    return <div id="conditions">
        <div className="container">
            <div className="main-heading">
                <h3 className="title-heading">الشروط والأحكام</h3>
            </div>
            <div className="row">
                <div className="col-lg-3">
                    <Slider/>
                </div>
                <div className="col-lg-9 col-12">
                    <h3 className="conditions-title">الشروط والأحكام</h3>
                    <p className="conditions-desc">لوريم إيبسوم(Lorem Ipsum) هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات
                        هذا القرن مع إصدار رقائق "ليتراسيت" (enetreset) البلاستيكية تحوي مقاطع من هذا النص، وعاد لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل "ألدوس بايج مايكر" (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم إيبسوم. خلافاَ للإعقاد السائد فإن لوريم إيبسوم ليس نصاَ عشوائياً، بل إن له جذور في الأدب اللاتيني الكلاسيكي منذ العام 45 قبل الميلاد، مما يجعله أكثر من 2000 عام في القدم. قام البروفيسور "ريتشارد ماك لينثوك" (Richard McClinton) وهو بروفيسور اللغة اللاتينية
                        في جامعة
                        هام بدن-سيدني في فيرجينيا بالبحث عن أصول كلمة لاتينية غامضة في نص لوريم إيبسوم وهي "consecrate"، وخلال تتبعه لهذه الكلمة في الأدب اللاتيني اكتشف المصدر الغير قابل للشك. فلقد اتضح أن كلمات نص لوريم إيبسوم تأتي من الأقسام 1.10.32 و 1.10.33 من كتاب "حول أقاصي الخير والشر" (de Minibus Bono-rum et Malo-rum) للمفكر فيشيرون (Cicero) والذي كتبه في عام 45 قبل الميلاد. هذا الكتاب هو بمثابة مقالة علمية مطولة في نظرية الأخلاق، وكان له شعبية كبيرة في عصر النهضة. السطر الأول من لوريم
                        إيبسوم "Lorem
                        ipsum dolor sit amet.." يأتي من سطر في القسم 1.20.32 من هذا الكتاب. للمهتمين قمنا بوضع نص لوريم إبسوم القياسي والمُستخدم منذ القرن الخامس عشر في الأسفل. وتم أيضاً توفير الأقسام 1.10.32 و 1.10.33 من "حول أقاصي الخير والشر" (de Minibus Bono-rum et Malo-rum) لمؤلفه فيشيرون (Cicero) بصيغها الأصلية، مرفقة بالنسخ الإنكليزية لها والتي قام بترجمتها هـ.راكهام (H. Rack-ham) في عام 1914.
                    </p>
                </div>
            </div>
        </div>
    </div>
}
